<?php
class RestaurantView
{
    public $shop1 = array(
        'id' => 1,
        'review' => '<dl><dt>★★★★☆</dt>'
        .'<dd>Wine Bar ENOTECA<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>Wine Bar ENOTECA<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'
    );
    public $shop2 = array(
        'id' => 2,
        'star' => '★★★★☆',
        'review' => '<dl><dt>★★★★☆</dt>'.'<dd>スペイン料理 ポルファボール！<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>スペイン料理 ポルファボール！<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'
    );
    public $shop3 = array(
        'id' => 3,
        'star' => '★★★★☆',
        'review' => '<dl><dt>★★★★☆</dt>'.'<dd>パス・パスタ<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>パス・パスタ<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'

    );
    public $shop4 = array(
        'id' => 4,
        'star' => '★★★★☆',
        'review' => '<dl><dt>★★★★☆</dt>'.'<dd>レストラン「有閑」<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>レストラン「有閑」<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'
    );
    public $shop5 = array(
        'id' => 5,
        'star' => '★★★★☆',
        'review' => '<dl><dt>★★★★☆</dt>'.'<dd>ビストロ「ルーヴル」<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>ビストロ「ルーヴル」<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'
    );
    public $shop6 = array(
        'id' => 6,
        'star' => '★★★★☆',
        'review' => '<dl><dt>★★★★☆</dt>'.'<dd>海沿いのレストラン La Mer<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>W海沿いのレストラン La Mer<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'
    );
    public $shop7 = array(
        'id' => 7,
        'star' => '★★★★☆',
        'review' => '<dl><dt>★★★★☆</dt>'.'<dd>レストラン さくら<br>常連の者で、いつも夫婦で伺っています。席数が少ないので予約した方が安心ですが、'
        .'その分落ち着いて食事できますよ。コースのメインは基本的にシェフにお任せ。来るたびに、'
        .'新しい味との出会いを楽しめるお店です。（totsukai)</dd></dl>'
        .'<dl><dt>★★★★★</dt>'
        .'<dd>レストラン さくら<br>説明の通り、喧騒を外れた場所にひっそりとあるレストランでした。伊豆市には初めて来ましたが、本当に桜がきれいですね。'
        .'何よりも空気がきれいで、いいリフレッシュになりました。（oie）</dd></dl>'
    );
}
// -------------------------------------
$array_view = new RestaurantView();
for ($i=0; $i<=7; $i++) {
    $shop = "shop"."{$i}";
    ${$shop} = array(
        'id' => $array_view->{$shop}['id'],
        'star' => $array_view->{$shop}['star'],
        'review' => $array_view->{$shop}['review']
    );
}


?>